In [2]:
### variance and standard deviation correlation

In [10]:
coke = [10,20,30]
fanta = [10,20,40]
cake = [11,30,40]

In [11]:
import pandas as pd

In [12]:
df = pd.DataFrame({"mycoke":coke,"myfanta":fanta,"mycake":cake})

In [13]:
df

   mycoke  myfanta  mycake
0      10       10      11
1      20       20      30
2      30       40      40

In [14]:
df.corr()

           mycoke   myfanta    mycake
mycoke   1.000000  0.981981  0.984324
myfanta  0.981981  1.000000  0.933257
mycake   0.984324  0.933257  1.000000